precursor_kEpsilonUltraFine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3240
(
(0.063203 1.38715e-10 7.7699e-12)
(0.0632025 -2.37757e-09 1.8452e-10)
(0.0632027 2.30941e-09 -2.44996e-10)
(0.0790072 -1.98075e-10 -6.63706e-11)
(0.079005 -2.23491e-10 4.47803e-10)
(0.0790047 5.64355e-10 -3.75984e-10)
(0.0916724 -1.40493e-09 -7.25476e-11)
(0.0916704 3.97797e-09 4.39157e-10)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
