precursor_kEpsilonUltraFine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
3240
(
0.000134414
0.00013441
0.000134412
0.000361764
0.000361746
0.000361741
0.000438919
0.000438901
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
216
(
0.000129764
0.000186775
0.000218508
0.000218508
0.000251361
0.000285471
0.00032092
0.000357725
...
)
;
    }
    noSlipWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
90
(
0.000129764
0.000321054
0.000392186
0.000445257
0.000488409
0.000524762
0.00055647
0.000585117
...
)
;
    }
}


// ************************************************************************* //
